N = int(input())

A = list(map(int, input().split()))

dp = [1] * N

for i in range(1, N): # 배열 A의 각 요소 순회, 현재 i
    for j in range(i): # i 이전의 값 순회
        if A[i] > A[j]:
            dp[i] = max(dp[i], dp[j] + 1)
            # dp[j] + 1은 A[j]까지의 최장 증가 부분 수열의 길이에 A[i]를 추가한 길이

print(max(dp))


'''
- input: 10 20 10 30 20 50
- 초기화: dp = [1, 1, 1, 1, 1, 1]
i = 1, j = 0: 
    A[1] > A[0] → dp[1] = max(1, 1 + 1) → dp = [1, 2, 1, 1, 1, 1]
i = 2, j = 0, 1: 
    A[2] <= A[0], A[2] <= A[1] → dp = [1, 2, 1, 1, 1, 1]
i = 3, j = 0, 1, 2: 
    A[3] > A[0] → dp[3] = max(1, 1 + 1) → dp = [1, 2, 1, 2, 1, 1]
    A[3] > A[1] → dp[3] = max(2, 2 + 1) → dp = [1, 2, 1, 3, 1, 1]
i = 4, j = 0, 1, 2, 3: 
    A[4] > A[0] → dp[4] = max(1, 1 + 1) → dp = [1, 2, 1, 3, 2, 1]
i = 5, j = 0, 1, 2, 3, 4: 
    A[5] > A[0] → dp[5] = max(1, 1 + 1) → dp = [1, 2, 1, 3, 2, 2]
    A[5] > A[1] → dp[5] = max(2, 2 + 1) → dp = [1, 2, 1, 3, 2, 3]
    A[5] > A[3] → dp[5] = max(3, 3 + 1) → dp = [1, 2, 1, 3, 2, 4]
'''